app/controllers/userlists_controller.rb

SELECT "userlists".* FROM "userlists"
---
  def index
    @userlists = Userlist.all

INSERT INTO "userlists" ("code", "created_at", "updated_at") VALUES (?, ?, ?)  [["code", ""], ["created_at", Mon, 21 Jul 2014 12:39:44 UTC +00:00], ["updated_at", Mon, 21 Jul 2014 12:39:44 UTC +00:00]]
---
  def create
    @userlist = Userlist.new(userlist_params)

    respond_to do |format|
      if @userlist.save

SELECT "userlists".* FROM "userlists" WHERE "userlists"."id" = ? LIMIT 1  [["id", "_form"]]
---
    def set_userlist
      @userlist = Userlist.find(params[:id])